Revit 2026 API

# StartingViewSettingsViewId Property

---

Indicates the specific view that will be opened when the model is loaded. InvalidElementId indicates that no view has been specified. In that case, Revit will open the last views that were open at the time the file was saved.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId ViewId { get; set; }
```
```vb
Public Property ViewId As ElementId
	Get
	Set
```
```cpp
public:
property ElementId^ ViewId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```
```fsharp
member ViewId : ElementId with get, set
```

#### Property Value

ElementId

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: viewId is not an acceptable starting view for this model. |
| ArgumentNullException | When setting this property: A non-optional argument was null |

Note that InvalidElementId will cause Revit to open the same view it would have used in Revit 2011 and prior releases.

#### Reference

StartingViewSettings Class

Autodesk.Revit.DB Namespace